{
  "ENFJ": {
    "추천 직종": "보건·의료직",
    "추천 직업": "예술치료사",
    "추천 직업의 업무 내용": "사회적, 심리적, 정서적 문제를 안고 있는 내담자들에게 예술활동을 통해서 갈등문제를 분석, 진단하고 치료한다.",
    "직업 만족도": "75.1 %",
    "직업 월급": {
      "lower25": 215,
      "median": 250,
      "upper25": 285
    },
    "직업 방향": "심리치료를 예술활동을 통해 한다는 점에서 예술과 심리 두 영역에 대한 전문지식이 필수다. 음악이나 미술 등 예술활동과 관련된 공부를 하고, 심리치료에 대한 자격증을 취득하고 진출한다. 치료대상자인 아동이나 청소년, 성인 등에 대한 깊은 이해가 필요하며 심리적으로 문제가 있는 부분을 파악하고 치료계획을 세울 수 있어야 한다. 침착한 태도와 원만한 대인관계능력, 인내심, 포용력, 개방성, 창의성 등을 갖춰야 한다.",
    "유사 직업": [
      "철학연구원",
      "교통영향평가원",
      "여행 안내원"
    ]
  },
  "ENFP": {
    "추천 직종": "연구직 및 공학 기술직",
    "추천 직업": "심리학 연구원",
    "추천 직업의 업무 내용": "인간의 행동과 심리과정을 비롯하여 의학·교육·산업 등의 분야에서 심리적 문제를 진단하고 해결방안을 제시한다.",
    "직업 만족도": "74.1 %",
    "직업 월급": {
      "lower25": 335,
      "median": 417,
      "upper25": 667
    },
    "직업 방향": "심리학연구원이 되기 위해서는 심리학과에 진학하여 석사학위 이상의 학력을 소지해야 한다. 석·박사 학위과정에 진학하면 세부적인 자신의 전공 분야를 선택하게 되는데 보통 향후 이와 관련된 분야에서 연구를 수행하게 된다. 특히 사회과학연구원이 되기 위해서는 연구 프로젝트에 참여하거나 연구보조원(RA)으로 근무해 다양한 연구경험을 쌓으면 유리하다.",
    "유사 직업": [
      "소아청소년과의사",
      "임상심리사",
      "한의사"
    ]
  },
  "ENTJ": {
    "추천 직종": "연구직 및 공학 기술직",
    "추천 직업": "풍력발전연구 및 개발자",
    "추천 직업의 업무 내용": "풍력발전시스템의 효율 향상 및 안정성을 위한 기계장치, 발전기 및 발전안정화 장치 등을 연구한다.",
    "직업 만족도": "76.2 %",
    "직업 월급": {
      "lower25": 381,
      "median": 583,
      "upper25": 667
    },
    "직업 방향": "풍력발전은 바람으로 풍력발전기의 회전날개를 돌려 전기를 얻는 발전시스템으로 전기, 항공, 구조, 제어 등에 대한 전문지식이 요구된다. 풍력발전은 바람의 수평운동을 회전운동으로 바꿔 변환된 운동에너지로 전기를 얻는 것이므로 기계공학, 전기공학, 제어계측학, 건축설비공학 등의 전공자가 진출하기 적합하다. 석사 이상의 학력이 요구되며 특히 바람에너지를 회전력으로 변환시키는 장치로 풍력발전기 성능에 큰 영향을 미치는 블레이드(blade), 로터, 증속기 등의 연구, 개발, 설계하려면 관련 세부전공자가 도전하기에 적합하다.",
    "유사 직업": [
      "건설기계공학기술자 및 연구원",
      "시스템소프트웨어개발자",
      "대학교수"
    ]
  },
  "ENTP": {
    "추천 직종": "연구직 및 공학 기술직",
    "추천 직업": "가상현실전문가",
    "추천 직업의 업무 내용": "이용자가 실제 세계와 유사한 느낌을 갖도록 3D모델링 및 VRML 등의 기술을 이용해 3차원 가상현실시스템을 개발한다.",
    "직업 만족도": "74.8 %",
    "직업 월급": {
      "lower25": 294,
      "median": 344,
      "upper25": 416
    },
    "직업 방향": "가상현실전문가는 대학, 전문대 또는 직업전문학교에서 컴퓨터소프트웨어나 전산, 정보처리 등을 공부한 후에 관련업체에 취업하는 것이 일반적이지만 비전공자의 경우에도 실무능력에 따라 취업과 성공이 결정되기 때문에 학력이나 전공에 상관없이 소프트웨어개발에 흥미를 갖고 독학으로 성공한 사람들도 많다. 취업하게 되면 보통 2∼3년 정도 실무경험을 쌓은 후에 본격적으로 프로그래머로서 역할을 수행하게 된다. 또한 이들에게는 디자인의 개념, 과학에 대한 기초적 지식 및 창의력, 인내력 등이 필요하며 컴퓨터프로그램을 이해하고 현실과 가상을 연결하는 노력등이 있어야 한다. 기본적으로 소프트웨어의 분석·설계·구현·테스트 등에 관한 이론적 지식과 실무 경험이 필요하다.",
    "유사 직업": [
      "유리·유리제품생산기계조작원",
      "귀금속·보석세공원",
      "방수공"
    ]
  },
  "ESFJ": {
    "추천 직종": "연구직 및 공학 기술직",
    "추천 직업": "위험관리원",
    "추천 직업의 업무 내용": "각 산업현장에 배속되어 유해 및 위험방지에 관한 사항, 사고사례분석 및 개선에 관한 사항, 근로자의 안전교육 및 훈련에 관한 업무를 수행한다.",
    "직업 만족도": "69.3 %",
    "직업 월급": {
      "lower25": 284,
      "median": 312,
      "upper25": 373
    },
    "직업 방향": "위험관리원이 되려면 보통 전문대학이나 대학교에서 기계, 전기·전자, 건축·토목, 화학공학, 소방 및 산업안전공학 등을 전공하고 해당 자격증취득 시 취업에 유리하다. 직업훈련기관이나 기술학원에도 산업안전기사 등의 자격취득을 위한 산업안전과정 등이 개설되어 있다.",
    "유사 직업": [
      "전기감리기술자",
      "환경시험원",
      "전기안전기술자"
    ]
  },
  "ESFP": {
    "추천 직종": "경영·사무·금융·보험직",
    "추천 직업": "예술·디자인·방송관리자",
    "추천 직업의 업무 내용": "신문사, 방송사, 영화사, 연극단체, 도서관, 기록보관소, 박물관, 화랑 등 문화, 예술, 디자인, 영상 관련 분야 기관운영을 기획, 지휘 및 조정한다.",
    "직업 만족도": "76.7 %",
    "직업 월급": {
      "lower25": 417,
      "median": 583,
      "upper25": 708
    },
    "직업 방향": "방송, 언론, 영상, 광고, 영화, 공연 관련 분야에서 경력을 쌓아 관리자로 승진하거나 스카우트 되는 경우가 많다. 주로 방송제작 분야의 경험이나 경력이 관리자로서의 업무수행에 도움이 된다.",
    "유사 직업": [
      "운송관리자",
      "안무가",
      "예능강사"
    ]
  },
  "ESTJ": {
    "추천 직종": "연구직 및 공학 기술직",
    "추천 직업": "산업안전원 및 위험관리원",
    "추천 직업의 업무 내용": "산업안전원은 안전한 작업환경 조성을 위해 산업재해예방계획을 수립하고, 산업재해 원인 조사, 재발 방지 대책 수립, 근로자에 대한 안전, 보건 교육 및 계도 등의 업무를 한다. 위험관리원은 각 산업현장에 배속되어 유해 및 위험방지에 관한 사항, 사고사례분석 및 개선에 관한 사항, 근로자의 안전교육 및 훈련에 관한 업무를 한다.",
    "직업 만족도": "72.4 %",
    "직업 월급": {
      "lower25": 446,
      "median": 542,
      "upper25": 750
    },
    "직업 방향": "산업안전원 및 위험관리원이 되려면 보통 전문대학이나 대학교에서 기계, 전기·전자, 건축·토목, 화학공학, 소방 및 산업안전공학 등을 전공하고 해당 자격증취득 시 취업에 유리하다. 직업훈련기관이나 기술학원에도 산업안전기사 등의 자격취득을 위한 산업안전과정 등이 개설되어 있다.",
    "유사 직업": [
      "간호사",
      "영업기획·관리·지원사무원",
      "환경영향평가원"
    ]
  },
  "ESTP": {
    "추천 직종": "연구직 및 공학 기술직",
    "추천 직업": "통신망운영기술자",
    "추천 직업의 업무 내용": "통신망의 병목현상을 해소하고, 통화 완료율 향상 및 기존망 효율 극대화 등을 위해 연구·개발한다.",
    "직업 만족도": "62.7 %",
    "직업 월급": {
      "lower25": 292,
      "median": 354,
      "upper25": 458
    },
    "직업 방향": "통신망운영기술자가 되기 위해서는 전기, 전자 및 통신관련 공학분야의 대학 이상을 졸업하는 것이 좋다. 또한 기업에서 자격증을 필수적으로 요구하지는 않더라도, 기사 이상의 자격증 취득은 취업에 매우 유리하다. 유능한 통신망운영기술자가 되려면 전자공학 분야와 통신 및 컴퓨터공학 분야의 폭넓은 지식이 필요하다. 채용은 통신망 설계 전문 기업 또는 대기업 계열 정보시스템 사업분야에서 공채를 실시한다.",
    "유사 직업": [
      "교통계획·설계가",
      "경영·진단전문가",
      "조경기술자"
    ]
  },
  "INFJ": {
    "추천 직종": "연구직 및 공학 기술직",
    "추천 직업": "사회학연구원",
    "추천 직업의 업무 내용": "인간 집단의 행동, 발달, 구조 및 사회 집단생활에서 발생하는 사회조직 및 사회적 상호작용 등을 연구하고 사회적 문제들에 대한 해결 방법 및 정책적 대안 등을 탐색한다.",
    "직업 만족도": "71.3 %",
    "직업 월급": {
      "lower25": 331,
      "median": 425,
      "upper25": 550
    },
    "직업 방향": "사회학연구원이 되기 위해서는 사회학 분야에 해당하는 학과에 진학하여 석사학위 이상의 학력을 소지해야 한다. 석·박사 학위과정에 진학하면 세부적인 자신의 전공 분야를 선택하게 되는데 보통 향후 이와 관련된 분야에서 연구를 수행하게 된다. 연구 프로젝트에 참여하거나 연구보조원(RA)으로 근무해 다양한 연구경험을 쌓으면 유리하다.",
    "유사 직업": [
      "축산학 및 수의학연구원",
      "네트워크관리자",
      "토양환경기술자 및 연구원"
    ]
  },
  "INFP": {
    "추천 직종": "연구직 및 공학 기술직",
    "추천 직업": "통신망운영기술자",
    "추천 직업의 업무 내용": "통신망의 병목현상을 해소하고, 통화 완료율 향상 및 기존망 효율 극대화 등을 위해 연구·개발한다.",
    "직업 만족도": "62.7 %",
    "직업 월급": {
      "lower25": 292,
      "median": 354,
      "upper25": 458
    },
    "직업 방향": "통신망운영기술자가 되기 위해서는 전기, 전자 및 통신관련 공학분야의 대학 이상을 졸업하는 것이 좋다. 또한 기업에서 자격증을 필수적으로 요구하지는 않더라도, 기사 이상의 자격증 취득은 취업에 매우 유리하다. 유능한 통신망운영기술자가 되려면 전자공학 분야와 통신 및 컴퓨터공학 분야의 폭넓은 지식이 필요하다. 채용은 통신망 설계 전문 기업 또는 대기업 계열 정보시스템 사업분야에서 공채를 실시한다.",
    "유사 직업": [
      "교통계획·설계가",
      "경영·진단전문가",
      "조경기술자"
    ]
  },
  "INTJ": {
    "추천 직종": "연구직 및 공학 기술직",
    "추천 직업": "지리정보시스템전문가",
    "추천 직업의 업무 내용": "상하수도, 도로, 지하매설물 등 각종 지리정보의 데이터베이스를 구축,관리하기 위한 지리정보시스템을 설계하고, 이와 관련한 기술을 개발하고 활용방안을 연구한다.",
    "직업 만족도": "72.6 %",
    "직업 월급": {
      "lower25": 325,
      "median": 408,
      "upper25": 542
    },
    "직업 방향": "지리정보시스템전문가(GIS전문가)가 되기 위해서는 전문대학 및 대학교의 지리정보나 공간정보, 지적 관련 학과를 졸업하고 관련 자격증을 취득한 후 취업하는 것이 일반적이다. GIS 등 전산 업무가 증가하면서 정보처리 관련 학과 졸업자들도 지적·측량업체에 취업하고 있다. 취업 시 자격증 소지가 필수요건은 아니지만 우대를 받을 수 있다. 관련 자격으로 측량 및 지형공간정보기술사/기사/산업기사, 측량기능사, 지적기술사/기사/산업기사/기능사, 도화기능사, 지도제작기능사, 항공사진기능사, 정보처리산업기사(이상 한국산업인력공단) 등이 있다. 측량전문업체나 지도제작업체, 공간정보업체, 건설회사, 부동산감정평가회사 등의 민간업체나 한국토지주택공사, 한국수자원공사, 한국도로공사, 한국농어촌공사, 한국국토정보공사 등의 공공기관에 취업할 수 있다. 또한 지방자치단체의 지적직 공무원과 국토교통부 국토지리정보원의 측지직 공무원으로 진출할 수 있다. 관련 석·박사 출신은 공공 및 민간 연구소에 취업할 수 있다. 이 외에 정보통신 관련 기업체, 물류유통업체 등에 취업할 수 있고, 측량 및 지형공간정보 구축, 시스템개발 및 통합, 융복합 콘텐츠 개발 관련 업체를 창업하기도 한다.",
    "유사 직업": [
      "교재·교구 및 이러닝교육전문가",
      "운송관리자",
      "농림어업시험원"
    ]
  },
  "INTP": {
    "추천 직종": "연구직 및 공학 기술직",
    "추천 직업": "건축가(건축설계사)",
    "추천 직업의 업무 내용": "각종 건축물 건설 및 수리를 계획하고 설계한다.",
    "직업 만족도": "68.3 %",
    "직업 월급": {
      "lower25": 381,
      "median": 475,
      "upper25": 644
    },
    "직업 방향": "건축설계사(건축사)가 되기 위해서는 대학교 건축학과(5년제)나 건축공학과(4년제), 전문대학 건축과(2~3년제) 또는 건축전문대학원을 졸업한 후, 건축사사무소에 취업하여 건축사보로서 일정 기간 실무 경력을 쌓은 후 건축사(대한건축사협회에서 시험 주관, 국토교통부에서 자격 발급) 자격을 취득하는 것이 일반적이다. 드물지만 특성화고등학교나 3년제 고등기술학교 건축과에서 교육을 받은 후 현장경력을 쌓은 후 건축사 자격을 취득하는 경우도 있다. 건축물의 설계와 공사감리 등의 업무를 수행하는 건축사 자격을 갖추려면 국토교통부에서 시행하는 건축사 자격시험을 통과해야 한다. 건축사 자격시험의 응시자격은 다음의 3가지 요건 중 하나를 충족해야 한다. ① 건축사사무소 개설신고를 하고 건축사업을 하고 있는 건축사사무소에서 대통령령으로 정하는 방에 따라 3년(인증 5년제 건축학과 또는 건축학대학원 이수자) 또는 4년 이상(비인증 5년제 건축학과 또는 건축학대학원 이수자) 실무수련을 받은 사람 ② 외국에서 건축사 면허를 받거나 자격을 취득한 자로서 건축사법에 따라 건축사의 자격과 같은 자격이 있다고 국토교통부장관이 인정하는 사람으로서 통틀어 5년 이상 건축에 관한 실무경력이 있는 사람③ 건축사예비시험에 합격한 사람으로서 건축사예비시험의 응시자격을 취득한 날부터 5년 이상(5년 이상의 건축학 학위과정을 이수하고 그 학위를 취득한 사람은 4년 이상) 건축에 관한 실무경력을 쌓은 사람. 2019년까지 건축사예비시험에 합격한 자에 한해 2026년까지 건축사 자격시험에 응시 가능 건축설계 교육을 담당하는 건축학과는 예전에는 4년제였으나 지금은 국내 건축사 자격에 대한 국제 인증을 받기 위해 5년제로 개편되었다. 건축학과에서는 건축설계, 건축구조, 건축시공, 건축재료, 건축응용학, 건축계획, 건축법규, 제도실습 등을 배운다. 건축설계사는 주로 건축사사무소에 취업하거나 개업을 하며, 일부는 일반건설회사나 플랜트설계회사, 엔지니어링회사 등에 취업한다. 대형 건축사사무소나 건설회사의 경우에는 공개채용을 통해 취업하는 경우가 대부분이다. 중소형 건축사사무소의 경우에는 수시로 필요에 따라 채용하고, 교수나 선배의 추천으로 취업하는 경우가 있다. 건축사사무소에 입사하여 건축사보로서 일정 기간 실무경력을 쌓은 후에 건축사 시험에 합격하면 자신의 건축사사무소를 개설할 수 있다. 최근에는 건축사사무소 간의 경쟁이 치열해 지면서 건축사 자격을 취득하더라도 건축사사무소를 곧바로 개설하지 않고, 경력과 경영 능력을 키운 후에 사무소를 개설하는 경우가 많다. 건축설계사는 건축설계에 대한 지식 및 기술 외에 건축주의 요구사항을 조정하고 다양한 시공업자들의 업무를 조율하는 능력이 필요하다.",
    "유사 직업": [
      "해외영업원",
      "여행상품개발자",
      "토목구조설계기술자"
    ]
  },
  "ISFJ": {
    "추천 직종": "연구직 및 공학 기술직",
    "추천 직업": "보건위생·환경검사원",
    "추천 직업의 업무 내용": "환경 및 위생과 관련된 불만을 조사하고 음식점, 식품가공 및 산업체, 호텔, 지역 상수시스템 및 기타 작업장의 위생, 공해관리, 위험물처리에 대하여 환경시설물을 평가하며, 식수나 용수를 정기적으로 채취·검사하고, 대기 오염원의 정기적 측정, 쓰레기 및 폐기물의 효율적 처리를 관리한다.",
    "직업 만족도": "73.4 %",
    "직업 월급": {
      "lower25": 292,
      "median": 321,
      "upper25": 385
    },
    "직업 방향": "보건위생 및 환경검사원으로 활동하기 위해서는 식품공학, 환경공학, 화학공학이나 보건 및 안전 분야를 전공하는 것이 유리하다. 관련 분야를 전공하면 환경에 대한 연구와 설계, 개발 및 제조공정, 설치, 조작, 유지에 관한 공학적 개념과 원리를 배우게 된다. 또한, 보건위생 및 환경검사원은 오염물의 분석을 위해 화학 및 생물에 대한 지식이 필요하고 규정 위반 행위를 적발하기 위해 관련법을 이해하고 있어야 한다. 공공부문, 민간부문 전체에 걸쳐 고용되는데, 공해방지시설이 필요한 기업체의 환경전담 부서, 방위산업체, 보건연구소, 방재시설업체, 환경용역업체 등에서 일하고 환경부 등 환경과 관련된 전문공무원이나 보건직 공무원인 식품위생감시원으로 일하기도 한다.",
    "유사 직업": [
      "환경시험원",
      "석유·천연가스제조제어장치조작원",
      "소음진동기술자 및 연구원"
    ]
  },
  "ISFP": {
    "추천 직종": "건설·채굴직",
    "추천 직업": "건축목공",
    "추천 직업의 업무 내용": "건축물 내·외부의 장식, 방음, 실용성 제고 등을 위해 목재구조물 및 고정설치물을 성형·조립·보수·가공한다.",
    "직업 만족도": "68.5 %",
    "직업 월급": {
      "lower25": 300,
      "median": 333,
      "upper25": 458
    },
    "직업 방향": "건축목공이 되기 위해 특별한 자격이나 학력이 요구되지 않는다. 건축목공은 건축현장에서 숙련공의 보조원으로서 도제식 현장교육을 받으며 일을 배우는 경우가 많다. 공업계 고등학교나 직업전문학교에서 실습 위주의 훈련을 받고 관련 자격증을 취득하면 취업 시 유리하다. 관련 자격으로 건축목재시공기능장, 건축목공산업기사/기능사, 거푸집기능사, 실내건축기능사(이상 한국산업인력공단) 등이 있다. 주로 해당 전문공사업체에 소속되어 일을 한다. 숙련공의 조력공(비숙련기능공)으로서 보통 2~10년 정도 경력을 쌓으면 기능공으로 인정을 받는다. 시설물유지보수업체나 전문건설업체를 창업할 수도 있다. 협동심과 배려심, 꼼꼼함, 책임감이 요구된다.",
    "유사 직업": [
      "건물도장공",
      "패션소품디자이너",
      "유리·유리제품생산기계조작원"
    ]
  },
  "ISTJ": {
    "추천 직종": "연구직 및 공학 기술직",
    "추천 직업": "정보보안전문가",
    "추천 직업의 업무 내용": "정보시스템과 정보자산을 보호하기 위해 보안정책을 수립하고, 시스템에 대한 접근 및 운영을 통제하며, 침입 발생시 신속히 탐지하여 즉각적으로 대응·복구한다.",
    "직업 만족도": "72 %",
    "직업 월급": {
      "lower25": 417,
      "median": 550,
      "upper25": 750
    },
    "직업 방향": "컴퓨터 보안 업무를 하기 위해서는 각종 운영체제(OS)와 H/W는 물론 네트워크, 프로그래밍, 데이터베이스 등 다양한 컴퓨터 관련 지식이 필요하다. 따라서 전문대학이나 대학교의 컴퓨터나 정보보호 관련 학과 등에서 IT 분야 전반에 대한 지식을 쌓은 후 진출하는 것이 유리할 수 있고, 정보보호 관련 동아리 활동 경력이나 각종 보안 관련 대회에서 수상한 경력도 도움이 된다. 또한, 컴퓨터 보안과 관련된 사설교육기관의 교육과정을 이수할 수도 있다. 취직 후에도 업무 분야나 IT 환경 변화에 따라 꾸준한 자기계발이 필수적이다.",
    "유사 직업": [
      "전기·전자공학시험원",
      "증권사무원",
      "법무사 및 집행관"
    ]
  },
  "ISTP": {
    "추천 직종": "연구직 및 공학 기술직",
    "추천 직업": "소방공학기술자 및 연구원",
    "추천 직업의 업무 내용": "발주자가 의뢰한 건축시설물에 대해 소방 설계의 적합성 여부를 검토하고 시공업자가 수행하는 소방설비의 설치여부에 대해 공정 및 품질관리를 한다.",
    "직업 만족도": "74.8 %",
    "직업 월급": {
      "lower25": 375,
      "median": 504,
      "upper25": 719
    },
    "직업 방향": "소방공학기술자가 되기 위해서는 소방공학과, 소방방재학과 소방안전관리과, 기계공학과, 전기공학과 등을 전공하는 것이 유리하다. 소방공학분야는 설계, 시공, 안전관리, 감리 등 역할이 세분화되어 있고 소방, 전기, 기계 등 전문 분야도 다양하여 진출가능한 전공분야도 다양하다. 주로 진출가능한 전공분야로는 관련자격으로는 국가자격으로 방화관리(1,2급), 소방설비기계기사, 소방설비전기기사, 소방설비산업기사(전기/기계), 위험물관리기능사, 가스안전기사, 산업안전(기사·산업기사), 소방기술사, 소방설비산업기사(기사), 위험물기능사(산업기사?기능장) 등이 있다. 통상 취업시 관련 자격을 요구하므로 취득하는 것이 유리하다. 취업시 기업체 마다 상이하나 전문대졸 이상의 학력을 요구하고 기술개발 등 연구 및 개발의 경우 석사이상의 학력을 요구하기도 한다. 이들은 주로 소방설계, 시공, 관리 업체에서 근무하며 소방관련 공공기관 및 기술개발 연구소, 그리고 공무원으로도 활동한다.",
    "유사 직업": [
      "일반의사",
      "전기·가스·수도관리자",
      "항공운송사무원"
    ]
  }
}